In [7]:
import pandas as pd
import numpy as np

In [2]:
file_path="/workspaces/tir103/data-pipeline/resource/data_with_nan.csv"
df = pd.read_csv(file_path)
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [3]:
df["col1"][3]

nan

In [4]:
type(df["col1"][3])

float

In [5]:
type(None)

NoneType

In [6]:
#mean只算有值的
df["col2"].mean()

np.float64(28.5)

In [8]:
df[
    df["col1"].notna()
]

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [9]:
df[
    df["col1"].isna()
]

  col1  col2 col3
3  NaN   NaN  NaN
5  NaN   NaN  NaN

In [10]:
df[
    df["col1"].isnull()
]

  col1  col2 col3
3  NaN   NaN  NaN
5  NaN   NaN  NaN

In [11]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [12]:
df.dropna()

    col1  col2 col3
1  test2  44.0  aaa

In [15]:
#任一欄位有值就留下
df.dropna(thresh=1)

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [17]:
df["col2"]=df["col2"].fillna(0)
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   0.0  NaN
3    NaN   0.0  NaN
4  test5   0.0  bbb
5    NaN   0.0  NaN

In [19]:
df["col1"].fillna(method="ffill")

/tmp/ipykernel_79010/2941000901.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["col1"].fillna(method="ffill")

0    test1
1    test2
2    test3
3    test3
4    test5
5    test5
Name: col1, dtype: object

In [20]:
df["col1"].ffill()

0    test1
1    test2
2    test3
3    test3
4    test5
5    test5
Name: col1, dtype: object

In [21]:
df["col1"].bfill()

0    test1
1    test2
2    test3
3    test5
4    test5
5      NaN
Name: col1, dtype: object